<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"0304438a922829ea8857946ec9d26b0a8219f7f8fc2f5b62fb0196e8b8811ff2","plan_job_ref":"Job Terraform checks on pull request #52 at https://github.com/sudoblark/sudoblark.terraform.github/actions/runs/17485825112","plan_out_hash":"1565d075d8894d2cfc594cb68de3d886ada9f4350f66b7966586a652e2059263","plan_hash":"ea1c3fee7f432128379efb810df6b05cf4976cf9370e7bcf34815d118b5b6783","plan_text_format":"diff-trunc","version":"1.49.0"} -->
Terraform plan in __./__
<details>
<summary>Plan: 94 to add, 125 to change, 78 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
-   destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.repositories[".github"].github_repository_file.codeowners will be created
+   resource "github_repository_file" "codeowners" {
+       branch              = "main"
+       commit_author       = (known after apply)
+       commit_email        = (known after apply)
+       commit_message      = "docs/CODEOWNERS - managed by sudoblark.terraform.github"
+       commit_sha          = (known after apply)
+       content             = <<-EOT
            * @benjaminlukeclark
        EOT
+       file                = "docs/CODEOWNERS"
+       id                  = (known after apply)
+       overwrite_on_create = true
+       repository          = ".github"
+       sha                 = (known after apply)
    }

  # module.repositories[".github"].github_repository_file.commit_to_pull_request_workflow will be created
+   resource "github_repository_file" "commit_to_pull_request_workflow" {
+       branch              = "main"
+       commit_author       = (known after apply)
+       commit_email        = (known after apply)
+       commit_message      = ".github/workflows/commit_to_pull_request.yaml - initial creation by sudoblark.terraform.github"
+       commit_sha          = (known after apply)
+       file                = ".github/workflows/commit_to_pull_request.yaml"
+       id                  = (known after apply)
+       overwrite_on_create = true
+       repository          = ".github"
+       sha                 = (known after apply)
    }

  # module.repositories[".github"].github_repository_file.gitignore will be updated in-place
!~  resource "github_repository_file" "gitignore" {
!~      commit_message      = ".gitignore - managed by sudoblark.terraform.github" -> ".gitignore - initial creation by sudoblark.terraform.github"
        id                  = ".github/.gitignore"
#        (9 unchanged attributes hidden)
    }

  # module.repositories[".github"].github_repository_file.license will be updated in-place
!~  resource "github_repository_file" "license" {
!~      content             = <<-EOT
            Copyright (c) 2024, Sudoblark Ltd
            All rights reserved.
            
            Redistribution and use in source and binary forms, with or without
            modification, are permitted provided that the following conditions are met:
            
            * Redistributions of source code must retain the above copyright notice, this
              list of conditions and the following disclaimer.
            
            * Redistributions in binary form must reproduce the above copyright notice,
              this list of conditions and the following disclaimer in the documentation
              and/or other materials provided with the distribution.
            
            * Neither the name of the copyright holder nor the names of its
              contributors may be used to endorse or promote products derived from
              this software without specific prior written permission.
            
            THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
            AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
            IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
            DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
            FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
            DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
            SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
            CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
            OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
            OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
        EOT -> (known after apply)
        id                  = ".github/LICENSE.txt"
#        (9 unchanged attributes hidden)
    }

  # module.repositories[".github"].github_repository_file.precommit will be updated in-place
!~  resource "github_repository_file" "precommit" {
!~      commit_message      = ".pre-commit-config.yaml - managed by sudoblark.terraform.github" -> "pre-commit-config.yaml - initial creation by sudoblark.terraform.github"
        id                  = ".github/.pre-commit-config.yaml"
#        (9 unchanged attributes hidden)
    }

  # module.repositories[".github"].github_repository_file.pull-request-template will be destroyed
  # (because github_repository_file.pull-request-template is not in configuration)
-   resource "github_repository_file" "pull-request-template" {
-       branch              = "main" -> null
-       commit_author       = "sudoblark-bot" -> null
-       commit_email        = "141588119+sudoblark-bot@users.noreply.github.com" -> null
-       commit_message      = "pull_request_template.md - managed by sudoblark.terraform.github" -> null
-       commit_sha          = "3073e1daacb8c288da75282f14484e2988d07b40" -> null
-       content             = <<-EOT
            # Description
            
            Please include a summary of the changes and the related issue. Please also include relevant motivation and context. List any dependencies that are required for this change.
            
            Fixes # (issue)
            
            ## Type of change
            
            Please delete options that are not relevant.
            
            - [ ] Bug fix (non-breaking change which fixes an issue)
            - [ ] New feature (non-breaking change which adds functionality)
            - [ ] Breaking change (fix or feature that would cause existing functionality to not work as expected)
            - [ ] This change requires a documentation update
            
            # How Has This Been Tested?
            
            Please describe the tests that you ran to verify your changes. Provide instructions so we can reproduce. Please also list any relevant details for your test configuration
            
            - [ ] Test A
            - [ ] Test B
            
            # Checklist:
            
            - [] My code follows the style guidelines of this project
            - [] I have made corresponding changes to the documentation
        EOT -> null
-       file                = ".github/pull_request_template.md" -> null
-       id                  = ".github/.github/pull_request_template.md" -> null
-       overwrite_on_create = true -> null
-       repository          = ".github" -> null
-       sha                 = "75e07ef21be7c01b9c3d060a0c03c9a665b58ba8" -> null
    }

  # module.repositories[".github"].github_repository_file.pull_request_template will be created
+   resource "github_repository_file" "pull_request_template" {
+       branch              = "main"
+       commit_author       = (known after apply)
+       commit_email        = (known after apply)
+       commit_message      = ".github/pull_request_template.md - managed by sudoblark.terraform.github"
+       commit_sha          = (known after apply)
+       content             = <<-EOT
            # Description
            
            Please include a summary of the changes and the related issue. Please also include relevant motivation and context. List any dependencies that are required for this change.
            
            Fixes # (issue)
            
            ## Type of change
            
            Please delete options that are not relevant.
            
            - [ ] Bug fix (non-breaking change which fixes an issue)
            - [ ] New feature (non-breaking change which adds functionality)
            - [ ] Breaking change (fix or feature that would cause existing functionality to not work as expected)
            - [ ] This change requires a documentation update
            
            # How Has This Been Tested?
            
            Please describe the tests that you ran to verify your changes. Provide instructions so we can reproduce. Please also list any relevant details for your test configuration
            
            - [ ] Test A
            - [ ] Test B
            
            # Checklist:
            
            - [] My code follows the style guidelines of this project
            - [] I have made corresponding changes to the documentation
            
        EOT
+       file                = ".github/pull_request_template.md"
+       id                  = (known after apply)
+       overwrite_on_create = true
+       repository          = ".github"
+       sha                 = (known after apply)
    }

  # module.repositories[".github"].github_repository_file.readme will be updated in-place
!~  resource "github_repository_file" "readme" {
!~      commit_message      = "README.md - initial creation by sudoblark.terraform.github" -> "README.md - initial creation bysudoblark.terraform.github"
        id                  = ".github/README.md"
#        (9 unchanged attributes hidden)
    }

  # module.repositories[".github"].github_repository_file.repository_codeowners_file will be destroyed
  # (because github_repository_file.repository_codeowners_file is not in configuration)
-   resource "github_repository_file" "repository_codeowners_file" {
-       branch              = "main" -> null
-       commit_author       = "sudoblark-bot" -> null
-       commit_email        = "141588119+sudoblark-bot@users.noreply.github.com" -> null
-       commit_message      = "CODEOWNERS - managed by sudoblark.terraform.github" -> null
-       commit_sha          = "11974f43b0c4d31cfafd64bd81a5f57ccc02d5b8" -> null
-       content             = <<-EOT
            # Default owners for all the things in the repo - managed by sudoblark.terraform.github
            * @benjaminlukeclark
        EOT -> null
-       file                = ".github/CODEOWNERS" -> null
-       id                  = ".github/.github/CODEOWNERS" -> null
-       overwrite_on_create = true -> null
-       repository          = ".github" -> null
-       sha                 = "bac7cb6446b7cf368e5e6065a7805b7df33576f0" -> null
    }

  # module.repositories["sudoblark.ai-ml.demos"].github_repository_file.codeowners will be created
+   resource "github_repository_file" "codeowners" {
+       branch              = "main"
+       commit_author       = (known after apply)
+       commit_email        = (known after apply)
+       commit_message      = "docs/CODEOWNERS - managed by sudoblark.terraform.github"
+       commit_sha          = (known after apply)
+       content             = <<-EOT
            * @benjaminlukeclark
        EOT
+       file                = "docs/CODEOWNERS"
+       id                  = (known after apply)
+       overwrite_on_create = true
+       repository          = "sudoblark.ai-ml.demos"
+       sha                 = (known after apply)
    }

  # module.repositories["sudoblark.ai-ml.demos"].github_repository_file.commit_to_pull_request_workflow will be created
+   resource "github_repository_file" "commit_to_pull_request_workflow" {
+       branch              = "main"
+       commit_author       = (known after apply)
+       commit_email        = (known after apply)
+       commit_message      = ".github/workflows/commit_to_pull_request.yaml - initial creation by sudoblark.terraform.github"
+       commit_sha          = (known after apply)
+       file                = ".github/workflows/commit_to_pull_request.yaml"
+       id                  = (known after apply)
+       overwrite_on_create = true
+       repository          = "sudoblark.ai-ml.demos"
+       sha                 = (known after apply)
    }

  # module.repositories["sudoblark.ai-ml.demos"].github_repository_file.gitignore will be updated in-place
!~  resource "github_repository_file" "gitignore" {
!~      commit_message      = ".gitignore - managed by sudoblark.terraform.github" -> ".gitignore - initial creation by sudoblark.terraform.github"
        id                  = "sudoblark.ai-ml.demos/.gitignore"
#        (9 unchanged attributes hidden)
    }

  # module.repositories["sudoblark.ai-ml.demos"].github_repository_file.license will be updated in-place
!~  resource "github_repository_file" "license" {
!~      content             = <<-EOT
            Copyright (c) 2024, Sudoblark Ltd
            All rights reserved.
            
            Redistribution and use in source and binary forms, with or without
            modification, are permitted provided that the following conditions are met:
            
            * Redistributions of source code must retain the above copyright notice, this
              list of conditions and the following disclaimer.
            
            * Redistributions in binary form must reproduce the above copyright notice,
              this list of conditions and the following disclaimer in the documentation
              and/or other materials provided with the distribution.
            
            * Neither the name of the copyright holder nor the names of its
              contributors may be used to endorse or promote products derived from
              this software without specific prior written permission.
            
            THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
            AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
            IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
            DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
            FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
            DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
            SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
            CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
            OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
            OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
        EOT -> (known after apply)
        id                  = "sudoblark.ai-ml.demos/LICENSE.txt"
#        (9 unchanged attributes hidden)
    }

  # module.repositories["sudoblark.ai-ml.demos"].github_repository_file.precommit will be updated in-place
!~  resource "github_repository_file" "precommit" {
!~      commit_message      = ".pre-commit-config.yaml - managed by sudoblark.terraform.github" -> "pre-commit-config.yaml - initial creation by sudoblark.terraform.github"
        id                  = "sudoblark.ai-ml.demos/.pre-commit-config.yaml"
#        (9 unchanged attributes hidden)
    }

  # module.repositories["sudoblark.ai-ml.demos"].github_repository_file.pull-request-template will be destroyed
  # (because github_repository_file.pull-request-template is not in configuration)
-   resource "github_repository_file" "pull-request-template" {
-       branch              = "main" -> null
-       commit_author       = "sudoblark-bot" -> null
-       commit_email        = "141588119+sudoblark-bot@users.noreply.github.com" -> null
-       commit_message      = "pull_request_template.md - managed by sudoblark.terraform.github" -> null
-       commit_sha          = "7e1622e28c093473cb2c5bdabe0e071a3aa55907" -> null
-       content             = <<-EOT
            # Description
            
            Please include a summary of the changes and the related issue. Please also include relevant motivation and context. List any dependencies that are required for this change.
            
            Fixes # (issue)
            
            ## Type of change
            
            Please delete options that are not relevant.
            
            - [ ] Bug fix (non-breaking change which fixes an issue)
            - [ ] New feature (non-breaking change which adds functionality)
            - [ ] Breaking change (fix or feature that would cause existing functionality to not work as expected)
            - [ ] This change requires a documentation update
            
            # How Has This Been Tested?
            
            Please describe the tests that you ran to verify your changes. Provide instructions so we can reproduce. Please also list any relevant details for your test configuration
            
            - [ ] Test A
            - [ ] Test B
            
            # Checklist:
            
            - [] My code follows the style guidelines of this project
            - [] I have made corresponding changes to the documentation
        EOT -> null
-       file                = ".github/pull_request_template.md" -> null
-       id                  = "sudoblark.ai-ml.demos/.github/pull_request_template.md" -> null
-       overwrite_on_create = true -> null
-       repository          = "sudoblark.ai-ml.demos" -> null
-       sha                 = "75e07ef21be7c01b9c3d060a0c03c9a665b58ba8" -> null
    }

  # module.repositories["sudoblark.ai-ml.demos"].github_repository_file.pull_request_template will be created
+   resource "github_repository_file" "pull_request_template" {
+       branch              = "main"
+       commit_author       = (known after apply)
+       commit_email        = (known after apply)
+       commit_message      = ".github/pull_request_template.md - managed by sudoblark.terraform.github"
+       commit_sha          = (known after apply)
+       content             = <<-EOT
            # Description
            
            Please include a summary of the changes and the related issue. Please also include relevant motivation and context. List any dependencies that are required for this change.
            
            Fixes # (issue)
            
            ## Type of change
            
            Please delete options that are not relevant.
            
            - [ ] Bug fix (non-breaking change which fixes an issue)
            - [ ] New feature (non-breaking change which adds functionality)
            - [ ] Breaking change (fix or feature that would cause existing functionality to not work as expected)
            - [ ] This change requires a documentation update
            
            # How Has This Been Tested?
            
            Please describe the tests that you ran to verify your changes. Provide instructions so we can reproduce. Please also list any relevant details for your test configuration
            
            - [ ] Test A
            - [ ] Test B
            
            # Checklist:
            
            - [] My code follows the style guidelines of this project
            - [] I have made corresponding changes to the documentation
            
        EOT
+       file                = ".github/pull_request_template.md"
+       id                  = (known after apply)
+       overwrite_on_create = true
+       repository          = "sudoblark.ai-ml.demos"
+       sha                 = (known after apply)
    }

  # module.repositories["sudoblark.ai-ml.demos"].github_repository_file.readme will be updated in-place
!~  resource "github_repository_file" "readme" {
!~      commit_message      = "README.md - initial creation by sudoblark.terraform.github" -> "README.md - initial creation bysudoblark.terraform.github"
        id                  = "sudoblark.ai-ml.demos/README.md"
#        (9 unchanged attributes hidden)
    }

  # module.repositories["sudoblark.ai-ml.demos"].github_repository_file.repository_codeowners_file will be destroyed
  # (because github_repository_file.repository_codeowners_file is not in configuration)
-   resource "github_repository_file" "repository_codeowners_file" {
-       branch              = "main" -> null
-       commit_author       = "sudoblark-bot" -> null
-       commit_email        = "141588119+sudoblark-bot@users.noreply.github.com" -> null
-       commit_message      = "CODEOWNERS - managed by sudoblark.terraform.github" -> null
-       commit_sha          = "01fcbe7396865697d151c284f7817fad56041eb5" -> null
-       content             = <<-EOT
            # Default owners for all the things in the repo - managed by sudoblark.terraform.github
            * @benjaminlukeclark
        EOT -> null
-       file                = ".github/CODEOWNERS" -> null
-       id                  = "sudoblark.ai-ml.demos/.github/CODEOWNERS" -> null
-       overwrite_on_create = true -> null
-       repository          = "sudoblark.ai-ml.demos" -> null
-       sha                 = "bac7cb6446b7cf368e5e6065a7805b7df33576f0" -> null
    }

  # module.repositories["sudoblark.azure-devops.library"].github_repository_file.codeowners will be created
+   resource "github_repository_file" "codeowners" {
+       branch              = "main"
+       commit_author       = (known after apply)
+       commit_email        = (known after apply)
+       commit_message      = "docs/CODEOWNERS - managed by sudoblark.terraform.github"
+       commit_sha          = (known after apply)
+       content             = <<-EOT
            * @benjaminlukeclark
        EOT
+       file                = "docs/CODEOWNERS"
+       id                  = (known after apply)
+       overwrite_on_create = true
+       repository          = "sudoblark.azure-devops.library"
+       sha                 = (known after apply)
    }

  # module.repositories["sudoblark.azure-devops.library"].github_repository_file.commit_to_pull_request_workflow will be created
+   resource "github_repository_file" "commit_to_pull_request_workflow" {
+       branch              = "main"
+       commit_author       = (known after apply)
+       commit_email        = (known after apply)
+       commit_message      = ".github/workflows/commit_to_pull_request.yaml - initial creation by sudoblark.terraform.github"
+       commit_sha          = (known after apply)
+       file                = ".github/workflows/commit_to_pull_request.yaml"
+       id                  = (known after apply)
+       overwrite_on_create = true
+       repository          = "sudoblark.azure-devops.library"
+       sha                 = (known after apply)
    }

  # module.repositories["sudoblark.azure-devops.library"].github_repository_file.gitignore will be updated in-place
!~  resource "github_repository_file" "gitignore" {
!~      commit_message      = ".gitignore - managed by sudoblark.terraform.github" -> ".gitignore - initial creation by sudoblark.terraform.github"
        id                  = "sudoblark.azure-devops.library/.gitignore"
#        (9 unchanged attributes hidden)
    }

  # module.repositories["sudoblark.azure-devops.library"].github_repository_file.license will be updated in-place
!~  resource "github_repository_file" "license" {
!~      content             = <<-EOT
            Copyright (c) 2024, Sudoblark Ltd
            All rights reserved.
            
            Redistribution and use in source and binary forms, with or without
            modification, are permitted provided that the following conditions are met:
            
            * Redistributions of source code must retain the above copyright notice, this
              list of conditions and the following disclaimer.
            
            * Redistributions in binary form must reproduce the above copyright notice,
              this list of conditions and the following disclaimer in the documentation
              and/or other materials provided with the distribution.
            
            * Neither the name of the copyright holder nor the names of its
              contributors may be used to endorse or promote products derived from
              this software without specific prior written permission.
            
            THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
            AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
            IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
            DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
            FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
            DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
            SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
            CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
            OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
            OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
        EOT -> (known after apply)
        id                  = "sudoblark.azure-devops.library/LICENSE.txt"
#        (9 unchanged attributes hidden)
    }

  # module.repositories["sudoblark.azure-devops.library"].github_repository_file.precommit will be updated in-place
!~  resource "github_repository_file" "precommit" {
!~      commit_message      = ".pre-commit-config.yaml - managed by sudoblark.terraform.github" -> "pre-commit-config.yaml - initial creation by sudoblark.terraform.github"
        id                  = "sudoblark.azure-devops.library/.pre-commit-config.yaml"
#        (9 unchanged attributes hidden)
    }

  # module.repositories["sudoblark.azure-devops.library"].github_repository_file.pull-request-template will be destroyed
  # (because github_repository_file.pull-request-template is not in configuration)
-   resource "github_repository_file" "pull-request-template" {
-       branch              = "main" -> null
-       commit_author       = "sudoblark-bot" -> null
-       commit_email        = "141588119+sudoblark-bot@users.noreply.github.com" -> null
-       commit_message      = "pull_request_template.md - managed by sudoblark.terraform.github" -> null
-       commit_sha          = "1626f5db931a6970e223991582a7719dd13f248f" -> null
-       content             = <<-EOT
            # Description
            
            Please include a summary of the changes and the related issue. Please also include relevant motivation and context. List any dependencies that are required for this change.
            
            Fixes # (issue)
            
            ## Type of change
            
            Please delete options that are not relevant.
            
            - [ ] Bug fix (non-breaking change which fixes an issue)
            - [ ] New feature (non-breaking change which adds functionality)
            - [ ] Breaking change (fix or feature that would cause existing functionality to not work as expected)
            - [ ] This change requires a documentation update
            
            # How Has This Been Tested?
            
            Please describe the tests that you ran to verify your changes. Provide instructions so we can reproduce. Please also list any relevant details for your test configuration
            
            - [ ] Test A
            - [ ] Test B
            
            # Checklist:
            
            - [] My code follows the style guidelines of this project
            - [] I have made corresponding changes to the documentation
        EOT -> null
-       file                = ".github/pull_request_template.md" -> null
-       id                  = "sudoblark.azure-devops.library/.github/pull_request_template.md" -> null
-       overwrite_on_create = true -> null
-       repository          = "sudoblark.azure-devops.library" -> null
-       sha                 = "75e07ef21be7c01b9c3d060a0c03c9a665b58ba8" -> null
    }

  # module.repositories["sudoblark.azure-devops.library"].github_repository_file.pull_request_template will be created
+   resource "github_repository_file" "pull_request_template" {
+       branch              = "main"
+       commit_author       = (known after apply)
+       commit_email        = (known after apply)
+       commit_message      = ".github/pull_request_template.md - managed by sudoblark.terraform.github"
+       commit_sha          = (known after apply)
+       content             = <<-EOT
            # Description
            
            Please include a summary of the changes and the related issue. Please also include relevant motivation and context. List any dependencies that are required for this change.
            
            Fixes # (issue)
            
            ## Type of change
            
            Please delete options that are not relevant.
            
            - [ ] Bug fix (non-breaking change which fixes an issue)
            - [ ] New feature (non-breaking change which adds functionality)
            - [ ] Breaking change (fix or feature that would cause existing functionality to not work as expected)
            - [ ] This change requires a documentation update
            
            # How Has This Been Tested?
            
            Please describe the tests that you ran to verify your changes. Provide instructions so we can reproduce. Please also list any relevant details for your test configuration
            
            - [ ] Test A
            - [ ] Test B
            
            # Checklist:
            
            - [] My code follows the style guidelines of this project
            - [] I have made corresponding changes to the documentation
            
        EOT
+       file                = ".github/pull_request_template.md"
+       id                  = (known after apply)
+       overwrite_on_create = true
+       repository          = "sudoblark.azure-devops.library"
+       sha                 = (known after apply)
    }

  # module.repositories["sudoblark.azure-devops.library"].github_repository_file.readme will be updated in-place
!~  resource "github_repository_file" "readme" {
!~      commit_message      = "README.md - initial creation by sudoblark.terraform.github" -> "README.md - initial creation bysudoblark.terraform.github"
        id                  = "sudoblark.azure-devops.library/README.md"
#        (9 unchanged attributes hidden)
    }

  # module.repositories["sudoblark.azure-devops.library"].github_repository_file.repository_codeowners_file will be destroyed
  # (because github_repository_file.repository_codeowners_file is not in configuration)
-   resource "github_repository_file" "repository_codeowners_file" {
-       branch              = "main" -> null
-       commit_author       = "sudoblark-bot" -> null
-       commit_email        = "141588119+sudoblark-bot@users.noreply.github.com" -> null
-       commit_message      = "CODEOWNERS - managed by sudoblark.terraform.github" -> null
-       commit_sha          = "eb07f07827e30e3480d62e59eca13b07bc148d35" -> null
-       content             = <<-EOT
            # Default owners for all the things in the repo - managed by sudoblark.terraform.github
            * @benjaminlukeclark
        EOT -> null
-       file                = ".github/CODEOWNERS" -> null
-       id                  = "sudoblark.azure-devops.library/.github/CODEOWNERS" -> null
-       overwrite_on_create = true -> null
-       repository          = "sudoblark.azure-devops.library" -> null
-       sha                 = "bac7cb6446b7cf368e5e6065a7805b7df33576f0" -> null
    }

  # module.repositories["sudoblark.azure-devops.workflows"].github_repository_file.codeowners will be created
+   resource "github_repository_file" "codeowners" {
+       branch              = "main"
+       commit_author       = (known after apply)
+       commit_email        = (known after apply)
+       commit_message      = "docs/CODEOWNERS - managed by sudoblark.terraform.github"
+       commit_sha          = (known after apply)
+       content             = <<-EOT
            * @benjaminlukeclark
        EOT
+       file                = "docs/CODEOWNERS"
+       id                  = (known after apply)
+       overwrite_on_create = true
+       repository          = "sudoblark.azure-devops.workflows"
+       sha                 = (known after apply)
    }

  # module.repositories["sudoblark.azure-devops.workflows"].github_repository_file.commit_to_pull_request_workflow will be created
+   resource "github_repository_file" "commit_to_pull_request_workflow" {
+       branch              = "main"
+       commit_author       = (known after apply)
+       commit_email        = (known after apply)
+       commit_message      = ".github/workflows/commit_to_pull_request.yaml - initial creation by sudoblark.terraform.github"
+       commit_sha          = (known after apply)
+       file                = ".github/workflows/commit_to_pull_request.yaml"
+       id                  = (known after apply)
+       overwrite_on_create = true
+       repository          = "sudoblark.azure-devops.workflows"
+       sha                 = (known after apply)
    }

  # module.repositories["sudoblark.azure-devops.workflows"].github_repository_file.gitignore will be updated in-place
!~  resource "github_repository_file" "gitignore" {
!~      commit_message      = ".gitignore - managed by sudoblark.terraform.github" -> ".gitignore - initial creation by sudoblark.terraform.github"
        id                  = "sudoblark.azure-devops.workflows/.gitignore"
#        (9 unchanged attributes hidden)
    }

  # module.repositories["sudoblark.azure-devops.workflows"].github_repository_file.license will be updated in-place
!~  resource "github_repository_file" "license" {
!~      content             = <<-EOT
            Copyright (c) 2024, Sudoblark Ltd
            All rights reserved.
            
            Redistribution and use in source and binary forms, with or without
            modification, are permitted provided that the following conditions are met:
            
            * Redistributions of source code must retain the above copyright notice, this
              list of conditions and the following disclaimer.
            
            * Redistributions in binary form must reproduce the above copyright notice,
              this list of conditions and the following disclaimer in the documentation
              and/or other materials provided with the distribution.
            
            * Neither the name of the copyright holder nor the names of its
              contributors may be used to endorse or promote products derived from
              this software without specific prior written permission.
            
            THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
            AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
            IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
            DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
            FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
            DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
            SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
            CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
            OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
            OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
        EOT -> (known after apply)
        id                  = "sudoblark.azure-devops.workflows/LICENSE.txt"
#        (9 unchanged attributes hidden)
    }

  # module.repositories["sudoblark.azure-devops.workflows"].github_repository_file.precommit will be updated in-place
!~  resource "github_repository_file" "precommit" {
!~      commit_message      = ".pre-commit-config.yaml - managed by sudoblark.terraform.github" -> "pre-commit-config.yaml - initial creation by sudoblark.terraform.github"
        id                  = "sudoblark.azure-devops.workflows/.pre-commit-config.yaml"
#        (9 unchanged attributes hidden)
    }

  # module.repositories["sudoblark.azure-devops.workflows"].github_repository_file.pull-request-template will be destroyed
  # (because github_repository_file.pull-request-template is not in configuration)
-   resource "github_repository_file" "pull-request-template" {
-       branch              = "main" -> null
-       commit_author       = "sudoblark-bot" -> null
-       commit_email        = "141588119+sudoblark-bot@users.noreply.github.com" -> null
-       commit_message      = "pull_request_template.md - managed by sudoblark.terraform.github" -> null
-       commit_sha          = "f36b5de2d43b2662177bd9c27f93cb41b520907b" -> null
-       content             = <<-EOT
            # Description
            
            Please include a summary of the changes and the related issue. Please also include relevant motivation and context. List any dependencies that are required for this change.
            
            Fixes # (issue)
            
            ## Type of change
            
            Please delete options that are not relevant.
            
            - [ ] Bug fix (non-breaking change which fixes an issue)
            - [ ] New feature (non-breaking change which adds functionality)
            - [ ] Breaking change (fix or feature that would cause existing functionality to not work as expected)
            - [ ] This change requires a documentation update
            
            # How Has This Been Tested?
            
            Please describe the tests that you ran to verify your changes. Provide instructions so we can reproduce. Please also list any relevant details for your test configuration
            
            - [ ] Test A
            - [ ] Test B
            
            # Checklist:
            
            - [] My code follows the style guidelines of this project
            - [] I have made corresponding changes to the documentation
        EOT -> null
-       file                = ".github/pull_request_template.md" -> null
-       id                  = "sudoblark.azure-devops.workflows/.github/pull_request_template.md" -> null
-       overwrite_on_create = true -> null
-       repository          = "sudoblark.azure-devops.workflows" -> null
-       sha                 = "75e07ef21be7c01b9c3d060a0c03c9a665b58ba8" -> null
    }

  # module.repositories["sudoblark.azure-devops.workflows"].github_repository_file.pull_request_template will be created
+   resource "github_repository_file" "pull_request_template" {
+       branch              = "main"
+       commit_author       = (known after apply)
+       commit_email        = (known after apply)
+       commit_message      = ".github/pull_request_template.md - managed by sudoblark.terraform.github"
+       commit_sha          = (known after apply)
+       content             = <<-EOT
            # Description
            
            Please include a summary of the changes and the related issue. Please also include relevant motivation and context. List any dependencies that are required for this change.
            
            Fixes # (issue)
            
            ## Type of change
            
            Please delete options that are not relevant.
            
            - [ ] Bug fix (non-breaking change which fixes an issue)
            - [ ] New feature (non-breaking change which adds functionality)
            - [ ] Breaking change (fix or feature that would cause existing functionality to not work as expected)
            - [ ] This change requires a documentation update
            
            # How Has This Been Tested?
            
            Please describe the tests that you ran to verify your changes. Provide instructions so we can reproduce. Please also list any relevant details for your test configuration
            
            - [ ] Test A
            - [ ] Test B
            
            # Checklist:
            
            - [] My code follows the style guidelines of this project
            - [] I have made corresponding changes to the documentation
            
        EOT
+       file                = ".github/pull_request_template.md"
+       id                  = (known after apply)
+       overwrite_on_create = true
+       repository          = "sudoblark.azure-devops.workflows"
+       sha                 = (known after apply)
    }

  # module.repositories["sudoblark.azure-devops.workflows"].github_repository_file.readme will be updated in-place
!~  resource "github_repository_file" "readme" {
!~      commit_message      = "README.md - initial creation by sudoblark.terraform.github" -> "README.md - initial creation bysudoblark.terraform.github"
        id                  = "sudoblark.azure-devops.workflows/README.md"
#        (9 unchanged attributes hidden)
    }

  # module.repositories["sudoblark.azure-devops.workflows"].github_repository_file.repository_codeowners_file will be destroyed
  # (because github_repository_file.repository_codeowners_file is not in configuration)
-   resource "github_repository_file" "repository_codeowners_file" {
-       branch              = "main" -> null
-       commit_author       = "sudoblark-bot" -> null
-       commit_email        = "141588119+sudoblark-bot@users.noreply.github.com" -> null
-       commit_message      = "CODEOWNERS - managed by sudoblark.terraform.github" -> null
-       commit_sha          = "853c14da1c5fe7ed4ce6e7c1cd95e89ecf1b3c93" -> null
-       content             = <<-EOT
            # Default owners for all the things in the repo - managed by sudoblark.terraform.github
            * @benjaminlukeclark
        EOT -> null
-       file                = ".github/CODEOWNERS" -> null
-       id                  = "sudoblark.azure-devops.workflows/.github/CODEOWNERS" -> null
-       overwrite_on_create = true -> null
-       repository          = "sudoblark.azure-devops.workflows" -> null
-       sha                 = "bac7cb6446b7cf368e5e6065a7805b7df33576f0" -> null
    }

  # module.repositories["sudoblark.github-actions.agent"].github_repository_file.codeowners will be created
+   resource "github_repository_file" "codeowners" {
+       branch              = "main"
+       commit_author       = (known after apply)
+       commit_email        = (known after apply)
+       commit_message      = "docs/CODEOWNERS - managed by sudoblark.terraform.github"
+       commit_sha          = (known after apply)
+       content             = <<-EOT
            * @benjaminlukeclark
        EOT
+       file                = "docs/CODEOWNERS"
+       id                  = (known after apply)
+       overwrite_on_create = true
+       repository          = "sudoblark.github-actions.agent"
+       sha                 = (known after apply)
    }

  # module.repositories["sudoblark.github-actions.agent"].github_repository_file.commit_to_pull_request_workflow will be created
+   resource "github_repository_file" "commit_to_pull_request_workflow" {
+       branch              = "main"
+       commit_author       = (known after apply)
+       commit_email        = (known after apply)
+       commit_message      = ".github/workflows/commit_to_pull_request.yaml - initial creation by sudoblark.terraform.github"
+       commit_sha          = (known after apply)
+       file                = ".github/workflows/commit_to_pull_request.yaml"
+       id                  = (known after apply)
+       overwrite_on_create = true
+       repository          = "sudoblark.github-actions.agent"
+       sha                 = (known after apply)
    }

  # module.repositories["sudoblark.github-actions.agent"].github_repository_file.gitignore will be updated in-place
!~  resource "github_repository_file" "gitignore" {
!~      commit_message      = ".gitignore - managed by sudoblark.terraform.github" -> ".gitignore - initial creation by sudoblark.terraform.github"
        id                  = "sudoblark.github-actions.agent/.gitignore"
#        (9 unchanged attributes hidden)
    }

  # module.repositories["sudoblark.github-actions.agent"].github_repository_file.license will be updated in-place
!~  resource "github_repository_file" "license" {
!~      content             = <<-EOT
            Copyright (c) 2024, Sudoblark Ltd
            All rights reserved.
            
            Redistribution and use in source and binary forms, with or without
            modification, are permitted provided that the following conditions are met:
            
            * Redistributions of source code must retain the above copyright notice, this
              list of conditions and the following disclaimer.
            
            * Redistributions in binary form must reproduce the above copyright notice,
              this list of conditions and the following disclaimer in the documentation
              and/or other materials provided with the distribution.
            
            * Neither the name of the copyright holder nor the names of its
              contributors may be used to endorse or promote products derived from
              this software without specific prior written permission.
            
            THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
            AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
            IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
            DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
            FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
            DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
            SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
            CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
            OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
            OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
        EOT -> (known after apply)
        id                  = "sudoblark.github-actions.agent/LICENSE.txt"
#        (9 unchanged attributes hidden)
    }

  # module.repositories["sudoblark.github-actions.agent"].github_repository_file.precommit will be updated in-place
!~  resource "github_repository_file" "precommit" {
!~      commit_message      = ".pre-commit-config.yaml - managed by sudoblark.terraform.github" -> "pre-commit-config.yaml - initial creation by sudoblark.terraform.github"
        id                  = "sudoblark.github-actions.agent/.pre-commit-config.yaml"
#        (9 unchanged attributes hidden)
    }

  # module.repositories["sudoblark.github-actions.agent"].github_repository_file.pull-request-template will be destroyed
  # (because github_repository_file.pull-request-template is not in configuration)
-   resource "github_repository_file" "pull-request-template" {
-       branch              = "main" -> null
-       commit_author       = "sudoblark-bot" -> null
-       commit_email        = "141588119+sudoblark-bot@users.noreply.github.com" -> null
-       commit_message      = "pull_request_template.md - managed by sudoblark.terraform.github" -> null
-       commit_sha          = "a4da2cb7e776372b941500e681bb9742a5016597" -> null
-       content             = <<-EOT
            # Description
            
            Please include a summary of the changes and the related issue. Please also include relevant motivation and context. List any dependencies that are required for this change.
            
            Fixes # (issue)
            
            ## Type of change
            
            Please delete options that are not relevant.
            
            - [ ] Bug fix (non-breaking change which fixes an issue)
            - [ ] New feature (non-breaking change which adds functionality)
            - [ ] Breaking change (fix or feature that would cause existing functionality to not work as expected)
            - [ ] This change requires a documentation update
            
            # How Has This Been Tested?
            
            Please describe the tests that you ran to verify your changes. Provide instructions so we can reproduce. Please also list any relevant details for your test configuration
            
            - [ ] Test A
            - [ ] Test B
            
            # Checklist:
            
            - [] My code follows the style guidelines of this project
            - [] I have made corresponding changes to the documentation
        EOT -> null
-       file                = ".github/pull_request_template.md" -> null
-       id                  = "sudoblark.github-actions.agent/.github/pull_request_template.md" -> null
-       overwrite_on_create = true -> null
-       repository          = "sudoblark.github-actions.agent" -> null
-       sha                 = "75e07ef21be7c01b9c3d060a0c03c9a665b58ba8" -> null
    }

  # module.repositories["sudoblark.github-actions.agent"].github_repository_file.pull_request_template will be created
+   resource "github_repository_file" "pull_request_template" {
+       branch              = "main"
+       commit_author       = (known after apply)
+       commit_email        = (known after apply)
+       commit_message      = ".github/pull_request_template.md - managed by sudoblark.terraform.github"
+       commit_sha          = (known after apply)
+       content             = <<-EOT
            # Description
            
            Please include a summary of the changes and the related issue. Please also include relevant motivation and context. List any dependencies that are required for this change.
            
            Fixes # (issue)
            
            ## Type of change
            
            Please delete options that are not relevant.
            
            - [ ] Bug fix (non-breaking change which fixes an issue)
Plan is too large to fit in a PR comment. See the full plan in the workflow log.
```
</details>

:memo: Plan generated in [Terraform checks on pull request #52](https://github.com/sudoblark/sudoblark.terraform.github/actions/runs/17485825112)